app/controllers/carts_controller.rb

INSERT INTO "carts" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2019-09-07 02:29:02.418253"], ["updated_at", "2019-09-07 02:29:02.418253"], ["user_id", 1]]
INSERT INTO "join_cart_items" ("cart_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cart_id", 1], ["item_id", 1], ["created_at", "2019-09-07 02:29:08.467416"], ["updated_at", "2019-09-07 02:29:08.467416"]]
---
  def create
    @u=current_user.id
    @i=session[:item_id]
  if current_user.cart == nil
      @cart = Cart.create(user_id: @u)
    end
        @cart = JoinCartItem.create(cart_id:current_user.cart.id, item_id: @i)

SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" INNER JOIN "join_cart_items" ON "items"."id" = "join_cart_items"."item_id" WHERE "join_cart_items"."cart_id" = $1  [["cart_id", 1]]
---
 def show
   @cart = Cart.find(params[:id])
   @tab= @cart.items
   allitems = current_user.cart.items
   c = 0
   @nbr = allitems.length