app/controllers/orders_controller.rb

  def create

    # Amount in cents
    @amount = 500

    customer = Stripe::Customer.create({
      email: params[:stripeEmail],
      source: params[:stripeToken],
    })

    charge = Stripe::Charge.create({
      customer: customer.id,
      amount: @amount,
      description: 'Payement enligne',
      currency: 'eur',
    })

  rescue Stripe::CardError => e
    flash[:error] = e.message

    @u=current_user.id
    @i=session[:item_id]
    @order = Order.create(user_id: @u)
    @commandes = JoinOrderItem.create(order_id:current_user.cart.id, item_id: @i)
      if @commandes.save
        @cart = Cart.find(current_user.cart.id)
        @join = @cart.join_cart_items.destroy_all
---
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2019-09-07 02:29:17.687074"], ["updated_at", "2019-09-07 02:29:17.687074"]]
INSERT INTO "join_order_items" ("order_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 1], ["item_id", 1], ["created_at", "2019-09-07 02:29:17.782004"], ["updated_at", "2019-09-07 02:29:17.782004"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "join_cart_items" WHERE "join_cart_items"."id" = $1  [["id", 1]]